import type { Timeline } from '@/types/Timeline';

const timelines: Timeline[] = [
  {
    date: '1999.05',
    description:
      '幼少期よりクラシックバレエを習い、幼い頃から自然と表現する場に身をおいていたことが、今の表現活動に繋がっている。',
  },
  {
    date: '2018.04',
    description:
      '國學院大学 経済学部に入学。経済や経営に関しては勿論、文学や心理学にも強く興味を持ち学部の幅を超えて多く学んだ。',
  },
  {
    date: '2019.04',
    description:
      '服飾のインカレに所属。服のデザインや縫製など服作りの1から全て行い、インカレが開催するファッションショーで披露した。',
  },
  {
    date: '2021.06',
    description:
      'モノづくりが好きだと実感し、制作を通して表現の楽しさを改めて感じた。その後Webデザインに興味をもち独学でデザインやコーディングを学ぶ。',
  },
  {
    date: '2022.04',
    description:
      '株式会社キノトロープにデザイナー職で新卒入社。メインデザイナーとして大小様々な案件に携わり経験を積む。',
  },
  {
    date: '2023.03',
    description:
      'vivivitが開催する現役デザイナー向けスクール「TAKI Design master 」の第4期生に。藤井賢二さんのもとで学び、約半年のスクールの中でMVPに選ばれる。',
  },
  {
    date: '2024.05',
    description:
      'ミームデザイン学校に通う。第一線で活躍されているデザイナーの方々からデザインの理念や実技を学ぶ。',
  },
];

export default timelines;
